// multimax ფუნქცია გამოითვლის მასზე
//გადაცემული პირველი არგუმენტსი და 
//დანარჩენი არგუმენტებიდან ყველაზე დიდის
//ნამრავლს.

function multiMax(multi){
    //უკან ბრუნდებ პირველ არგუმეტის 
    //რომელიც მიენიჭა პარამეტრ multi-ს და
    //math ობიექტის მეთოდის მიერ დაბრუნებლი
    //მაქსიმალური რიცხივს ნამრავლი
    //max()ფუნქციას გადაეცემა არგუმენტად 2 რამ
    //პირველი Math ობიექტი და მეორე არგუმენტების
    //სიისგან შექმნილი მასივი რომელშიც არ შედის პირველი
    //არგუმენტი. 
    return multi*Math.max.apply(Math,
            Array.prototype.slice.call(arguments,1));
            //ჩვენ ვაიძულებთ მასივის მეთოდს slice-ს
            //მოექცეს ჩვენს ობიექტს ისე როგორც ნამდვილ
            //მასივს და გახადოს თავის კონტექსტად.
}